# 1
# У вас есть список my_list со значениями типа int. Распечатать те значения,
# которые больше 100. Задание выполнить с помощью цикла for.
# my_list = [95, 105, 90, 110, 85, 115]
# for value in my_list:
#     if value < 100:
#         my_list.remove(value)
# print(my_list)

# 2
# У вас есть список my_list со значениями типа int и пустой список my_results.
# Добавить в my_results те значения, которые больше 100.
# Распечатать список my_results. Задание выполнить с помощью цикла for.
# my_list = [95, 105, 90, 110, 85, 115]
# my_results = []
# for value in my_list:
#     if value > 100:
#         my_results.append(value)
# print(my_results)

# 3
# У вас есть список my_list со значениями типа int.
# Если в my_list кол-во элементов < 2, то в конец добавить значение 0.
# Если кол-во элементов >= 2, то добавить сумму последних двух элементов.
# Количество элементов в списке можно получить с помощью функции len(my_list).
# my_list = [95, 105, 90, 110, 85, 115]
# # my_list = [95]  # для быстрой проверки
# if len(my_list) < 2:
#     my_list.append(0)
# else:
#     my_list.append(my_list[-1] + my_list[-2])
# print(my_list)

# 4
# Пользователь вводит value - число с запятой (например 3.14) с клавиатуры.
# Вы приводите это value к типу float и выводите результат выражения value ** -1.
# Написать программу, которая вычисляет данное выражение и корректно
# обрабатывает возможные исключения.

# 5
# У вас есть список my_list со значениями типа int и пустой список my_results.
# Добавить в my_results те значения из my_list для которых сумма индекса и значения
# будет четной. Пример. [1, 11, 20, 100]. Ответ [11, 20], потому что:
# индекс 1 + значение 11 это 12 - четное,
# индекс 2 + значение 20 это 22 - четное.

# 6
