# Тест 1. Python. Начало
# Оценка: 100 баллов

print(1 + 2 + 3)  # ответ: 6
print(1 * 2 * 3)  # ответ: 6
print("1 * 2 * 3")  # ответ: 1 * 2 * 3
print("1 + 2 + 3")  # ответ: 1 + 2 + 3
print("1" + "2" + "3")  # ответ: 123
print("1" + "2" * 3)  # ответ: 1222
print(("1" + "2") * 3)  # ответ: 121212
print(20 // 2)  # ответ: 10
print(20 / 2)  # ответ: 10.0
print(21 // 2)  # ответ: 10
print(-21 // 2)  # ответ: -11
print(-21 / 2)  # ответ: -10.5
print(21 % 2 - 1)  # ответ: 0
print(21 % 1 - 2)  # ответ: -2
print(21 % (1 - 2))  # ответ: 0

# Практика:
print(100 // (((192 % 9) * 11 + 7) / 2 - 10))
